# 实习三：非关系数据库
> 成员：罗逸龙2000017781  占可盈2000013136  范居令2000012942

## 第一题：窗口函数实现Alpha101量化因子

In [62]:
import tushare as ts
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## set this to your tushare token
TUSHARE_TOKEN = "bd64f388adebe21dd43ab0d399352666593a145bdc6b92abcae33b3b"
ts.set_token(TUSHARE_TOKEN)
pro = ts.pro_api()

data = pro.daily(ts_code='600019.SH', start_date='20110101', end_date='20230101')

print(len(data))
print(data.head())

2818
     ts_code trade_date  open  high   low  close  pre_close  change  pct_chg  \
0  600019.SH   20221230  5.65  5.65  5.57   5.59       5.60   -0.01  -0.1786
1  600019.SH   20221229  5.60  5.66  5.56   5.60       5.63   -0.03  -0.5329
2  600019.SH   20221228  5.65  5.68  5.60   5.63       5.60    0.03   0.5357
3  600019.SH   20221227  5.56  5.67  5.55   5.60       5.54    0.06   1.0830
4  600019.SH   20221226  5.64  5.64  5.51   5.54       5.66   -0.12  -2.1201

         vol      amount
0  226293.75  126690.768
1  235643.27  132153.801
2  318845.36  179787.366
3  329442.13  185118.785
4  366420.07  203221.327

In [63]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [64]:
import pymysql 
pymysql.install_as_MySQLdb()
%sql mysql://stu2000012942:stu2000012942@162.105.146.37:43306

In [65]:
%sql use stu2000012942

 * mysql://stu2000012942:***@162.105.146.37:43306
0 rows affected.

[]

In [66]:
%%sql

DROP TABLE IF EXISTS `tushare`;

CREATE TABLE `tushare` 
(
    `id` BIGINT UNSIGNED NOT NULL AUTO_INCREMENT, 
    `ts_code` VARCHAR(255) NOT NULL,
    `trade_date` VARCHAR(255) NOT NULL COMMENT 'date as YYYYMMDD',
    `open` DECIMAL(38, 10) NOT NULL,
    `high` DECIMAL(38, 10) NOT NULL,
    `low` DECIMAL(38, 10) NOT NULL,
    `close` DECIMAL(38, 10) NOT NULL,
    `pre_close` DECIMAL(38, 10) NOT NULL,
    `change` DECIMAL(38, 10) NOT NULL,
    `pct_chg` DECIMAL(38, 10) NOT NULL,
    `vol` DECIMAL(38, 10) NOT NULL,
    `amount` DECIMAL(38, 10) NOT NULL,
    PRIMARY KEY (`id`)
)ENGINE=InnoDB;

 * mysql://stu2000012942:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

In [67]:
STUDENTID = 'stu2000013136'
db = pymysql.connect(host='162.105.146.37',user=STUDENTID, password=STUDENTID, port=43306, db=STUDENTID)
cursor = db.cursor()

In [68]:
# load data to sql
data_list = np.array(data, dtype=str).tolist()
print(data_list[0])

tablename = "tushare"
key_list = "ts_code, trade_date, open, high, low, close, pre_close, change, pct_chg, vol, amount" 
insert_sql = "INSERT INTO `tushare`\
(`ts_code`, `trade_date`, `open`, `high`, `low`, `close`, `pre_close`, `change`, `pct_chg`, `vol`, `amount`) VALUES\
(%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)"
count = 0
for i in data_list:
    cursor.execute(insert_sql, i)
    count += 1

if count == len(data_list):
    db.commit()
else:
    db.rollback()
    print(count, len(data_list))

['600019.SH', '20221230', '5.65', '5.65', '5.57', '5.59', '5.6', '-0.01', '-0.1786', '226293.75', '126690.768']

In [69]:
%%sql
SELECT COUNT(*) FROM `tushare`;
SELECT * FROM `tushare` LIMIT 5;

 * mysql://stu2000012942:***@162.105.146.37:43306
1 rows affected.
0 rows affected.

[]

### Alpha006
$$
\begin{aligned}
\Alpha_{006} =  -1 \times \text{correlation}(\text{open}, \text{volume}, 10)
\end{aligned}
$$

In [70]:
%sql SELECT VERSION();

 * mysql://stu2000012942:***@162.105.146.37:43306
1 rows affected.

[('8.0.23',)]

In [71]:
%%sql
SELECT
    t2.ts_code,
    t2.trade_date,
    -1 * (t2.top / SQRT(t2.bottom_1 * t2.bottom_2)) AS `alpha006`
FROM (
    SELECT
        t1.ts_code,
        t1.trade_date,
        SUM((t1.open - t1.open_avg) * (t1.vol - t1.vol_avg))
            OVER (PARTITION BY t1.ts_code ORDER BY t1.trade_date ROWS BETWEEN 9 PRECEDING AND CURRENT ROW) AS `top`,
        SUM(POWER(t1.open - t1.open_avg, 2))
            OVER (PARTITION BY t1.ts_code ORDER BY t1.trade_date ROWS BETWEEN 9 PRECEDING AND CURRENT ROW) AS `bottom_1`,
        SUM(POWER(t1.vol - t1.vol_avg, 2))
            OVER (PARTITION BY t1.ts_code ORDER BY t1.trade_date ROWS BETWEEN 9 PRECEDING AND CURRENT ROW) AS `bottom_2`
    FROM (
        SELECT
            `ts_code`,
            `trade_date`,
            `open`,
            `vol`,
            AVG(`open`) OVER (PARTITION BY `ts_code` ORDER BY `trade_date` ROWS BETWEEN 9 PRECEDING AND CURRENT ROW) AS `open_avg`,
            AVG(`vol`) OVER (PARTITION BY `ts_code` ORDER BY `trade_date` ROWS BETWEEN 9 PRECEDING AND CURRENT ROW) AS `vol_avg`
        FROM `tushare`
        ORDER BY 
            ts_code,
            trade_date
    ) AS t1
    ORDER BY
        t1.ts_code,
        t1.trade_date
) AS t2
ORDER BY
    t2.ts_code,
    t2.trade_date
LIMIT 10
OFFSET 10;

 * mysql://stu2000012942:***@162.105.146.37:43306
0 rows affected.

[]

### Alpha023
$$
\begin{aligned}
\Alpha_{023} = \Big((\sum(\text{high}, 20) / 20) < \text{high}\Big) ? \Big(-1 \times \delta(\text{high}, 2)\Big) : 0
\end{aligned}
$$

In [72]:
%%sql

SELECT
    t1.ts_code,
    t1.trade_date,
    CASE
        WHEN (t1.sum / 20) < t1.high
        THEN t1.true
        ELSE 0
    END AS `alpha023`
FROM (
    SELECT
        ts_code,
        trade_date,
        high,
        SUM(`high`) OVER (PARTITION BY ts_code ORDER BY trade_date ROWS BETWEEN 19 PRECEDING AND CURRENT ROW) AS `sum`,
        high - LAG(high, 2) OVER (ORDER BY trade_date) AS `true`
    FROM `tushare`
) AS t1
ORDER BY
    t1.ts_code,
    t1.trade_date
LIMIT 10
OFFSET 20;

 * mysql://stu2000012942:***@162.105.146.37:43306
0 rows affected.

[]

### Alpha041
$$
\begin{aligned}
\Alpha_{041} =  ((\text{high} \times \text{low})^{0.5}) - \text{vwap}
\end{aligned}
$$

In [73]:
%%sql
SELECT 
    t1.ts_code,
    t1.trade_date,
    SQRT(t1.high * t1.low) - (t1.vwap_top / t1.vwap_bottom) AS 'alpha041'
FROM (
    SELECT
        ts_code,
        trade_date,
        high,
        low,
        SUM(`close` * `vol`) OVER (PARTITION BY trade_date) AS `vwap_top`,
        SUM(`vol`) OVER (PARTITION BY trade_date) AS `vwap_bottom`
    FROM `tushare`
    ORDER BY
        ts_code,
        trade_date
) AS t1
ORDER BY
    t1.ts_code,
    t1.trade_date
LIMIT 10;

 * mysql://stu2000012942:***@162.105.146.37:43306
0 rows affected.

[]

### Alpha053
$$
\begin{aligned}
\Alpha_{053} =  -1 * \delta\Big(\big(((\text{close} - \text{low}) - (\text{high} - \text{close})) / (\text{close} - \text{low})\big), 9\Big)
\end{aligned}
$$

In [74]:
%%sql
SELECT 
    t1.ts_code,
    t1.trade_date,
    t1.x - LAG(t1.x, 9) OVER (ORDER BY t1.trade_date) AS `alpha053`
FROM (
    SELECT
        ts_code,
        trade_date,
        ((`close` - `low`) - (`high` - `close`)) / (`close` - `low`) AS `x`
    FROM `tushare`
    ORDER BY
        ts_code,
        trade_date
) AS t1
ORDER BY
    t1.ts_code,
    t1.trade_date
LIMIT 10
OFFSET 10;

 * mysql://stu2000012942:***@162.105.146.37:43306
0 rows affected.

[]

### Alpha101
$$
\begin{aligned}
\Alpha_{101} =  (\text{close} - \text{open}) / (\text{high} - \text{low} + 0.001)
\end{aligned}
$$

In [75]:
%%sql
SELECT 
    ts_code,
    trade_date,
    (close - open) / (high - low + 0.001) AS 'alpha101'
FROM `tushare`
ORDER BY
        ts_code,
        trade_date
LIMIT 10;

 * mysql://stu2000012942:***@162.105.146.37:43306
0 rows affected.

[]

## 第二题：JSON

### 操作1

In [76]:
%%sql

DROP table IF EXISTS `employees`;

CREATE TABLE `employees` (
    `id` BIGINT UNSIGNED NOT NULL AUTO_INCREMENT,
    `info` JSON,
    PRIMARY KEY (`id`)
)

 * mysql://stu2000012942:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

In [77]:
from typing import List, Dict

with open('employees.txt', 'r') as file:
    lines = file.readlines()

# deliminators
c1 = '\x01' 
c2 = '\x02'
c3 = '\x03'

class Information:
    def __init__(self):
        self.name: str = ""
        self.salary: float = 0.0
        self.subordinates: List[str] = []
        self.deductions: Dict[str, float] = {}
        self.address: Dict[str, str] = {}

infos = []
for line in lines:
    i = Information()
    values = line.strip().split(c1)
    i.name = values[0]
    i.salary = float(values[1])
    i.subordinates = values[2].split(c2) if values[2] else []

    deductions = values[3].split(c2)
    for d in deductions:
        tmp = d.split(c3)
        tmp[0] = tmp[0].replace(' ', '_')
        i.deductions[tmp[0]] = float(tmp[1])
    
    addresses = values[4].split(c2)
    i.address["street"] = addresses[0]
    i.address["city"] = addresses[1]
    i.address["state"] = addresses[2]
    i.address["zip"] = addresses[3]

    infos.append(i)
    print(i.__dict__)

{'name': 'John Doe', 'salary': 100000.0, 'subordinates': ['Mary Smith', 'Todd Jones'], 'deductions': {'Federal_Taxes': 0.2, 'State_Taxes': 0.05, 'Insurance': 0.1}, 'address': {'street': '1 Michigan Ave.', 'city': 'Chicago', 'state': 'IL', 'zip': '60600'}}
{'name': 'Mary Smith', 'salary': 80000.0, 'subordinates': ['Bill King'], 'deductions': {'Federal_Taxes': 0.2, 'State_Taxes': 0.05, 'Insurance': 0.1}, 'address': {'street': '100 Ontario St.', 'city': 'Chicago', 'state': 'IL', 'zip': '60601'}}
{'name': 'Todd Jones', 'salary': 70000.0, 'subordinates': [], 'deductions': {'Federal_Taxes': 0.15, 'State_Taxes': 0.03, 'Insurance': 0.1}, 'address': {'street': '200 Chicago Ave.', 'city': 'Oak Park', 'state': 'IL', 'zip': '60700'}}
{'name': 'Bill King', 'salary': 60000.0, 'subordinates': [], 'deductions': {'Federal_Taxes': 0.15, 'State_Taxes': 0.03, 'Insurance': 0.1}, 'address': {'street': '300 Obscure Dr.', 'city': 'Obscuria', 'state': 'IL', 'zip': '60100'}}
{'name': 'Boss Man', 'salary': 200000.0, 'subordinates': ['John Doe', 'Fred Finance'], 'deductions': {'Federal_Taxes': 0.3, 'State_Taxes': 0.07, 'Insurance': 0.05}, 'address': {'street': '1 Pretentious Drive.', 'city': 'Chicago', 'state': 'IL', 'zip': '60500'}}
{'name': 'Fred Finance', 'salary': 150000.0, 'subordinates': ['Stacy Accountant'], 'deductions': {'Federal_Taxes': 0.3, 'State_Taxes': 0.07, 'Insurance': 0.05}, 'address': {'street': '2 Pretentious Drive.', 'city': 'Chicago', 'state': 'IL', 'zip': '60500'}}
{'name': 'Stacy Accountant', 'salary': 60000.0, 'subordinates': [], 'deductions': {'Federal_Taxes': 0.15, 'State_Taxes': 0.03, 'Insurance': 0.1}, 'address': {'street': '300 Main St.', 'city': 'Naperville', 'state': 'IL', 'zip': '60563'}}

In [78]:
from json import dumps

emp_insert_sql = "INSERT INTO `employees` (`info`) VALUES (%s)"

count = 0
for i in infos:
    js = dumps(i.__dict__)
    cursor.execute(emp_insert_sql, (js,))
    count += 1

if count == len(infos):
    db.commit()
else:
    db.rollback()
    print(count, len(infos))

In [79]:
%%sql
SELECT * FROM `employees`;

 * mysql://stu2000012942:***@162.105.146.37:43306
0 rows affected.

[]

### 操作2

In [80]:
%%sql

# 查询员工工资高于90000的员工的姓名和工资

select JSON_EXTRACT(info, '$.name') as name, JSON_EXTRACT(info, '$.salary') as salary from employees where JSON_EXTRACT(info, '$.salary') > 90000;

 * mysql://stu2000012942:***@162.105.146.37:43306
0 rows affected.

[]

In [81]:
%%sql

# 查询所有员工及其下属姓名

select JSON_EXTRACT(info, '$.name') as name, JSON_EXTRACT(info, '$.subordinates') as subordinates from employees;

 * mysql://stu2000012942:***@162.105.146.37:43306
0 rows affected.

[]

In [82]:
%%sql

# 查询所有住址为Chicago的员工

select JSON_EXTRACT(info, '$.name') as name from employees where JSON_SEARCH(info, 'all', 'Chicago') is not null;

 * mysql://stu2000012942:***@162.105.146.37:43306
0 rows affected.

[]

In [83]:
%%sql

# 根据insurance的大小对员工进行排序

select JSON_EXTRACT(info, '$.name') as name from employees order by JSON_EXTRACT(info, '$.deductions.Insurance') desc;

 * mysql://stu2000012942:***@162.105.146.37:43306
0 rows affected.

[]

In [84]:
%%sql

# 查询员工的住址信息

select JSON_EXTRACT(info, '$.name') as name, JSON_EXTRACT(info, '$.address.zip') as zip, JSON_EXTRACT(info, '$.address.city') as city, JSON_EXTRACT(info, '$.address.state') as state, JSON_EXTRACT(info, '$.address.street') as street from employees;

 * mysql://stu2000012942:***@162.105.146.37:43306
0 rows affected.

[]

### 操作3

In [85]:
%%sql


select name, salary, subordinates, Federal_Taxes, State_Taxes, Insurance, street, city, state, zip
from employees, json_table(info, '$' columns (
    name varchar(40) path '$.name',
    salary int path '$.salary',
    nested path '$.subordinates[*]' columns ( subordinates varchar(40) path '$' ),
    Federal_Taxes  varchar(40) path '$.deductions.Federal_Taxes',
    State_Taxes float path '$.deductions.State_Taxes',
    Insurance float path '$.deductions.Insurance',
    street varchar(40) path '$.address.street',
    city varchar(40) path '$.address.city',
    state varchar(40) path '$.address.state',
    zip varchar(40) path '$.address.zip')
    ) as t ;

 * mysql://stu2000012942:***@162.105.146.37:43306
0 rows affected.

[]

### 操作4

In [86]:
%%sql

drop table if exists Assembly;

create table Assembly(
id  int not null primary key auto_increment, 
part char(20),
subpart char(20));

insert into Assembly values 
(1,'trike','wheel'),
(2,'trike','frame'),
(3,'frame','seat'),
(4,'frame','pedal'),
(5,'wheel','spoke'),
(6,'wheel','tire'),
(7,'tire','rim'),
(8,'tire','tube');

select * from Assembly;

 * mysql://stu2000012942:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
8 rows affected.
8 rows affected.

[(1, 'trike', 'wheel'),
 (2, 'trike', 'frame'),
 (3, 'frame', 'seat'),
 (4, 'frame', 'pedal'),
 (5, 'wheel', 'spoke'),
 (6, 'wheel', 'tire'),
 (7, 'tire', 'rim'),
 (8, 'tire', 'tube')]

由于mysql中对绘图功能的支持，我们采用如下递归查询来查询每个节点在树中的层级，从而表示出树形结构。

In [87]:
%%sql

with recursive Components (level, id, part, subpart ) as
( select 0 as level, id, part, subpart 
    from Assembly where part = 'trike'
    union all
    select C.level+1,A.id, A.part, A.subpart
    from Assembly A, Components C 
    where A.part = C.subpart 
    )
select * from Components;

 * mysql://stu2000012942:***@162.105.146.37:43306
8 rows affected.

[(0, 1, 'trike', 'wheel'),
 (0, 2, 'trike', 'frame'),
 (1, 3, 'frame', 'seat'),
 (1, 4, 'frame', 'pedal'),
 (1, 5, 'wheel', 'spoke'),
 (1, 6, 'wheel', 'tire'),
 (2, 7, 'tire', 'rim'),
 (2, 8, 'tire', 'tube')]

In [88]:
%%sql

drop table if exists s_son;
create table s_son 
select part, concat(group_concat(subpart separator ',')) as sons  from Assembly group by part;

 * mysql://stu2000012942:***@162.105.146.37:43306
0 rows affected.
4 rows affected.

[]

In [89]:
%%sql

select * from s_son

 * mysql://stu2000012942:***@162.105.146.37:43306
4 rows affected.

[('frame', 'seat,pedal'),
 ('tire', 'rim,tube'),
 ('trike', 'wheel,frame'),
 ('wheel', 'spoke,tire')]

注意到当前的递归查询中当前的mysql不支持深度优先的递归查询，因此为了完成json嵌套数组的输出我们需要手动写一个深度优先搜索的过程，因此我们定义函数`dfs`来完成这一过程。
函数dfs接受两个参数，一个是root,为当前树的根，另外一个是subtree,为以root为根的子树的json表示。

In [90]:
%%sql


SET @@max_sp_recursion_depth = 100;
drop procedure if exists dfs;
create procedure dfs(in root varchar(20), out subtree varchar(1000))
begin
    declare left_son varchar(20);
    declare right_son varchar(20);
    declare sons_list varchar(1000);
    declare left_subtree varchar(1000);
    declare right_subtree varchar(1000);
    select sons from s_son where part = root into sons_list;
    if (exists (select sons from s_son where part = root )) then
        set left_son = substring_index(sons_list, ',', 1);
        set right_son = substring_index(sons_list, ',', -1);
        call dfs(left_son, left_subtree);
        call dfs(right_son, right_subtree);
        set subtree = concat(root, '[', left_subtree, ',', right_subtree, ']');
    else
        set subtree = root;
    end if;
end;

call dfs('trike', @result);
select @result;

 * mysql://stu2000012942:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.

[('trike[wheel[spoke,tire[rim,tube]],frame[seat,pedal]]',)]